### Report for email-and-alerting on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on s3.tf line 10, in resource "aws_s3_bucket" "gp2gp_inbox_storage":
  10:     ignore_changes  = [acl]

The attribute "acl" is deprecated. Refer to the provider documentation for
details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (2 to add, 7 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.store_asid_lookup_lambda will be created
  + resource "aws_iam_policy" "store_asid_lookup_lambda" {
      + arn         = (known after apply)
      + description = "IAM policy for Store ASID Lookup Lambda"
      + id          = (known after apply)
      + name        = "dev-store-asid-lookup-lambda-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + statement = [
                  + {
                      + action    = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_store_asid_lookup_lambda",
                        ]
                    },
                  + {
                      + action    = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + "arn:aws:s3:::prm-gp2gp-inbox-storage-dev/*",
                        ]
                    },
                  + {
                      + action    = [
                          + "s3:ListBucket",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + "arn:aws:s3:::prm-gp2gp-inbox-storage-dev",
                        ]
                    },
                  + {
                      + action    = [
                          + "s3:PutObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + "arn:aws:s3:::prm-gp2gp-asid-lookup-dev/*",
                        ]
                    },
                ]
              + version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.store_asid_lookup_lambda will be created
  + resource "aws_iam_role_policy_attachment" "store_asid_lookup_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-store-asid-lookup-lambda-role"
    }

  # aws_lambda_function.email_report_lambda will be updated in-place
  ~ resource "aws_lambda_function" "email_report_lambda" {
        id                             = "dev-email-report-lambda"
      ~ last_modified                  = "2025-07-17T14:22:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q4hIBcn+zm7k9Kpl2Vgk/D4UyhOi4V5bAWF7gN3eDM0=" -> "Qi+WVlzhlPSYX8Fsp+pBt5B9cB+lixZOKNJ4/Re9zkk="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-email-report-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.gp2gp_dashboard_alert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "gp2gp_dashboard_alert_lambda" {
        id                             = "dev-gp2gp-dashboard-alert-lambda"
      ~ last_modified                  = "2025-07-17T14:23:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "b1LXsobwPdlsQFufC0jBZNEgzNe2kMphBBuMk6uV9dU=" -> "aZ0hd8pa71CRjpd/wouApPk16uj7fykANTgW6T5POi0="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-gp2gp-dashboard-alert-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_pipeline_error_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_pipeline_error_lambda" {
        id                             = "dev-log-alerts-pipeline-error-lambda"
      ~ last_modified                  = "2025-07-17T14:22:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "78z3uWDvnwOU6Qr2RifAVEVXRjNBu5PehQu5i+5AY3w=" -> "4XMIvuJf4hgC/lup85zE6zzMRJJPAEzLa05g+UkiwnU="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-pipeline-error-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_technical_failures_above_threshold_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_technical_failures_above_threshold_lambda" {
        id                             = "dev-log-alerts-technical-failures-above-threshold-lambda"
      ~ last_modified                  = "2025-07-17T14:22:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "rQ4CC5w5Ox1grdaPaBQ/zjTW0NO4SoqGNhvIUgU3rRM=" -> "h5QlHmafT/eTa0nlqUVKghRqLm0d0re6jAwB16mQ1Ew="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.store_asid_lookup will be updated in-place
  ~ resource "aws_lambda_function" "store_asid_lookup" {
        id                             = "dev_store_asid_lookup_lambda"
      ~ last_modified                  = "2025-07-17T14:23:09.718+0000" -> (known after apply)
      ~ source_code_hash               = "baoB+IGMDy5S0Wtxu5539R/FrB/iuVR9SAzluN5vwHo=" -> "ucwPJXL02uHd5fSCHZyL6ayLg97/RnBLXIKh0Tir/L0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.gp2gp_inbox_storage will be updated in-place
  ~ resource "aws_s3_bucket_policy" "gp2gp_inbox_storage" {
        id     = "prm-gp2gp-inbox-storage-dev"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "343515223843"
                            }
                          + StringLike   = {
                              + "aws:SourceArn" = "arn:aws:ses:eu-west-2:343515223843:receipt-rule-set/gp2gp-inbox-rules-dev:receipt-rule/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ses.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::prm-gp2gp-inbox-storage-dev/*"
                      + Sid       = "AllowSESPuts"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_ses_receipt_rule.asid_lookup will be updated in-place
  ~ resource "aws_ses_receipt_rule" "asid_lookup" {
        id            = "store-asid-lookup-in-s3-dev"
        name          = "store-asid-lookup-in-s3-dev"
        # (6 unchanged attributes hidden)

      + lambda_action {
          + function_arn    = "arn:aws:lambda:eu-west-2:343515223843:function:dev_store_asid_lookup_lambda"
          + invocation_type = "Event"
          + position        = 2
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 7 to change, 0 to destroy.

```

</details>